Revit 2026 API

# ConnectorIsConnected Property

---

Identifies if the connector is physically connected to a connector on another element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsConnected { get; }
```
```vb
Public ReadOnly Property IsConnected As Boolean
	Get
```
```cpp
public:
property bool IsConnected {
	bool get ();
}
```
```fsharp
member IsConnected : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's type is LogicalConn. |

#### Reference

Connector Class

Autodesk.Revit.DB Namespace